import { Translation } from "../Types";

const translations: Translation = {
  accepted: "Поле павінна быць прынята.",
  after: "Поле павінна быць пасля {0}.",
  after_or_equal: "Поле павінна быць роўнае ці пасля {0}.",
  alpha: "У полі могуць знаходзіцца толькі літары.",
  alpha_dash:
    "У полі могуць знаходзіцца толькі літары, лічбы, дэфісы і падкрэсленьні.",
  alpha_num: "Поле павінна ўтрымліваць толькі літары і лічбы.",
  array: "Поле павінна быць масівам.",
  before: "Поле павінна быць да {0}.",
  before_or_equal: "Поле павінна быць роўнае ці да {0}.",
  between: "Поле павінна быць паміж {0} і {1}.",
  boolean: "Поле павінна быць лагічным значэннем.",
  confirmed: "Пацвярджэнне поля не супадае.",
  email: "Поле павінна быць адрасам электроннай пошты.",
  date: "Поле не мае правільнага фармата даты.",
  digits: "Поле павінна складацца з {0} лічбаў.",
  digits_between: "Поле павінна быць паміж {0} і {1} лічбамі.",
  in: "Выбранае поле несапраўднае.",
  integer: "Поле павінна быць цэлым лікам.",
  hex: "Поле павінна мець шаснаццатковы фармат",
  min: "Поле павінна быць не менш за {0}.",
  max: "Поле не можа быць больш за {0}.",
  not_in: "Выбранае поле несапраўднае.",
  numeric: "Поле павінна быць лікам.",
  required: "Гэта поле абавязкова для запаўнення.",
  size: "Памер поля павінен быць {0}.",
  string: "Поле павінна быць радком.",
  url: "Поле павінна быць URL-адрасам.",
};

export default translations;
