import { Translation } from "../Types";

const translations: Translation = {
  accepted: "Το πεδίο πρέπει να γίνει αποδεκτό.",
  after: "Το πεδίο πρέπει να είναι μετά από {0}.",
  after_or_equal: "Το πεδίο πρέπει να είναι ίσο ή μετά από {0}.",
  alpha: "Το πεδίο πρέπει να περιέχει μόνο αλφαβητικούς χαρακτήρες.",
  alpha_dash:
    "Το πεδίο μπορεί να περιέχει μόνο αλφαριθμητικούς χαρακτήρες, καθώς και παύλες και κάτω παύλες.",
  alpha_num: "Το πεδίο πρέπει να είναι αλφαριθμητικό.",
  array: "Το πεδίο πρέπει να είναι πίνακας.",
  before: "Το πεδίο πρέπει να είναι πριν από {0}.",
  before_or_equal: "Το πεδίο πρέπει να είναι ίσο ή πριν από {0}.",
  between: "Το πεδίο πρέπει να είναι μεταξύ {0} και {1}.",
  boolean: "Το πεδίο πρέπει να είναι λογική τιμή.",
  confirmed: "Η επιβεβαίωση του πεδίου δεν ταιριάζει.",
  email: "Το πεδίο πρέπει να είναι έγκυρη διεύθυνση email.",
  date: "Το πεδίο δεν έχει έγκυρη μορφή ημερομηνίας.",
  digits: "Το πεδίο πρέπει να έχει {0} ψηφία.",
  digits_between: "Το πεδίο πρέπει να έχει ανάμεσα σε {0} και {1} ψηφία.",
  in: "Το επιλεγμένο πεδίο δεν είναι έγκυρο.",
  integer: "Το πεδίο πρέπει να είναι ακέραιος αριθμός.",
  hex: "Το πεδίο πρέπει να έχει δεκαεξαδική μορφή",
  min: "Το πεδίο πρέπει να είναι τουλάχιστον {0}.",
  max: "Το πεδίο δεν πρέπει να είναι μεγαλύτερο από {0}.",
  not_in: "Το επιλεγμένο πεδίο δεν είναι έγκυρο.",
  numeric: "Το πεδίο πρέπει να είναι αριθμός.",
  required: "Το πεδίο είναι υποχρεωτικό.",
  size: "Το μέγεθος του πεδίου πρέπει να είναι {0}.",
  string: "Το πεδίο πρέπει να είναι αλφαριθμητικό.",
  url: "Το πεδίο πρέπει να είναι URL.",
};

export default translations;
