import { Translation } from "../Types";

const translations: Translation = {
  accepted: "فیلد باید پذیرفته شود.",
  after: "فیلد باید پس از {0} باشد.",
  after_or_equal: "فیلد باید برابر یا پس از {0} باشد.",
  alpha: "فیلد باید فقط شامل حروف الفبا باشد.",
  alpha_dash:
    "فیلد تنها می‌تواند شامل حروف الفبا، اعداد، خط تیره و آندرلاین باشد.",
  alpha_num: "فیلد باید عددی یا حروفی باشد.",
  array: "فیلد باید یک آرایه باشد.",
  before: "فیلد باید پیش از {0} باشد.",
  before_or_equal: "فیلد باید برابر یا پیش از {0} باشد.",
  between: "فیلد باید بین {0} و {1} باشد.",
  boolean: "فیلد باید یک مقدار بولین باشد.",
  confirmed: "تأیید فیلد مطابقت ندارد.",
  email: "فیلد باید یک ایمیل باشد.",
  date: "فرمت تاریخ فیلد معتبر نیست.",
  digits: "فیلد باید {0} رقم باشد.",
  digits_between: "فیلد باید بین {0} و {1} رقم باشد.",
  in: "انتخاب شده برای فیلد معتبر نیست.",
  integer: "فیلد باید یک عدد صحیح باشد.",
  hex: "فیلد باید دارای فرمت شانزده‌گانه باشد.",
  min: "فیلد باید حداقل {0} باشد.",
  max: "فیلد نمی‌تواند بیشتر از {0} باشد.",
  not_in: "انتخاب شده برای فیلد معتبر نیست.",
  numeric: "فیلد باید یک عدد باشد.",
  required: "فیلد الزامی است.",
  size: "اندازه فیلد باید {0} باشد.",
  string: "فیلد باید یک رشته باشد.",
  url: "فیلد باید یک آدرس اینترنتی باشد.",
};

export default translations;
