import { Translation } from "../Types";

const translations: Translation = {
  accepted: "フィールドは受け入れる必要があります。",
  after: "フィールドは {0} の後でなければなりません。",
  after_or_equal: "フィールドは {0} と等しいかそれ以降でなければなりません。",
  alpha: "フィールドはアルファベットのみを含む必要があります。",
  alpha_dash:
    "フィールドはアルファベット、数字、ダッシュ、アンダースコアのみを含むことができます。",
  alpha_num: "フィールドは英数字でなければなりません。",
  array: "フィールドは配列でなければなりません。",
  before: "フィールドは {0} の前でなければなりません。",
  before_or_equal: "フィールドは {0} と等しいかそれ以前でなければなりません。",
  between: "フィールドは {0} から {1} の間でなければなりません。",
  boolean: "フィールドは真偽値でなければなりません。",
  confirmed: "フィールドの確認が一致しません。",
  email: "フィールドはメールアドレスでなければなりません。",
  date: "フィールドは有効な日付形式ではありません。",
  digits: "フィールドは {0} 桁でなければなりません。",
  digits_between: "フィールドは {0} から {1} 桁の間でなければなりません。",
  in: "選択されたフィールドは無効です。",
  integer: "フィールドは整数でなければなりません。",
  hex: "フィールドは16進数形式である必要があります。",
  min: "フィールドは少なくとも {0} でなければなりません。",
  max: "フィールドは {0} を超えてはいけません。",
  not_in: "選択されたフィールドは無効です。",
  numeric: "フィールドは数値でなければなりません。",
  required: "フィールドは必須です。",
  size: "フィールドのサイズは {0} でなければなりません。",
  string: "フィールドは文字列でなければなりません。",
  url: "フィールドはURLでなければなりません。",
};

export default translations;
