import { Translation } from "../Types";

const translations: Translation = {
  accepted: "ვეთანხმებით ველს.",
  after: "ველი უნდა იყოს {0}-ზე შემდეგ.",
  after_or_equal: "ველი უნდა იყოს {0}-ზე ტოლი ან შემდეგ.",
  alpha: "ველი უნდა შეიცავდეს მხოლოდ ანბანურ სიმბოლოებს.",
  alpha_dash:
    "ველი შეიძლება შეიცავდეს მხოლოდ ალფა-ნუმერიკ სიმბოლოებს, ტირებებს და ქვედნებს.",
  alpha_num: "ველი უნდა იყოს ალფა-ნუმერიკული.",
  array: "ველი უნდა იყოს მასივი.",
  before: "ველი უნდა იყოს {0}-ზე წინ.",
  before_or_equal: "ველი უნდა იყოს {0}-ზე ტოლი ან წინ.",
  between: "ველი უნდა იყოს {0}-დან {1}-მდე.",
  boolean: "ველი უნდა იყოს ლოგიკური მნიშვნელობა.",
  confirmed: "ველის დადასტურება არ ემთხვევა.",
  email: "ველი უნდა იყოს ელ. ფოსტა.",
  date: "ველი არ არის სწორი თარიღის ფორმატში.",
  digits: "ველი უნდა იყოს {0} ციფრი.",
  digits_between: "ველი უნდა იყოს {0}-დან {1}-მდე ციფრი.",
  in: "არჩეული ველი არასწორია.",
  integer: "ველი უნდა იყოს მთლიანი რიცხვი.",
  hex: "ველი უნდა ჰქსადეც იყოს ფორმატირებული.",
  min: "ველი უნდა იყოს მინიმუმ {0}.",
  max: "ველი არ უნდა აღემატოს {0}-ს.",
  not_in: "არჩეული ველი არასწორია.",
  numeric: "ველი უნდა იყოს რიცხვი.",
  required: "ველი აუცილებელია.",
  size: "ველის ზომა უნდა იყოს {0}.",
  string: "ველი უნდა იყოს ტექსტი.",
  url: "ველი უნდა იყოს URL.",
};

export default translations;
