import { Translation } from "../Types";

const translations: Translation = {
  accepted: "Талбайг зөвшөөрч байх шаардлагатай.",
  after: "Талбайн утга {0}-с хойш байх шаардлагатай.",
  after_or_equal: "Талбайн утга {0} эсвэл түүнээс хойш байх шаардлагатай.",
  alpha: "Талбайн утга зөвхөн цагаан үсэг агуулсан байх шаардлагатай.",
  alpha_dash:
    "Талбайн утга зөвхөн цагаан үсэг, тоо, дэлгэц, зураас орсон байх шаардлагатай.",
  alpha_num: "Талбайн утга цагаан үсэг болон тоо агуулсан байх шаардлагатай.",
  array: "Талбайн утга массив байх шаардлагатай.",
  before: "Талбайн утга {0}-с өмнө байх шаардлагатай.",
  before_or_equal: "Талбайн утга {0} эсвэл түүнээс өмнө байх шаардлагатай.",
  between: "Талбайн утга {0} ба {1} хооронд байх шаардлагатай.",
  boolean: "Талбайн утга булан утга байх шаардлагатай.",
  confirmed: "Талбайн баталгаажуулалт таарахгүй байна.",
  email: "Талбайн утга и-мэйл хаяг байх шаардлагатай.",
  date: "Талбайн утга буруу огноо байна.",
  digits: "Талбайн утга {0} тоо байх шаардлагатай.",
  digits_between: "Талбайн утга {0} ба {1} тоо хооронд байх шаардлагатай.",
  in: "Сонгосон талбайн утга буруу байна.",
  integer: "Талбайн утга бүхэл тоо байх шаардлагатай.",
  hex: "Талбайн утга 16-тын тооны системт байх шаардлагатай.",
  min: "Талбайн утга хамгийн багадаа {0} байх шаардлагатай.",
  max: "Талбайн утга хамгийн ихдээ {0}-с их байх шаардлагатай.",
  not_in: "Сонгосон талбайн утга буруу байна.",
  numeric: "Талбайн утга тоо байх шаардлагатай.",
  required: "Талбайн утга шаардлагатай.",
  size: "Талбайн утгын хэмжээ {0} байх шаардлагатай.",
  string: "Талбайн утга тэмдэгт мөр байх шаардлагатай.",
  url: "Талбайн утга веб хаяг байх шаардлагатай.",
};

export default translations;
