import { Translation } from "../Types";

const translations: Translation = {
  accepted: "Поле повинно бути прийнято.",
  after: "Поле повинно бути після {0}.",
  after_or_equal: "Поле повинно бути рівне або після {0}.",
  alpha: "Поле повинно містити лише буквенні символи.",
  alpha_dash:
    "Поле може містити лише буквено-цифрові символи, а також дефіси та підкреслення.",
  alpha_num: "Поле повинно бути буквено-цифровим.",
  array: "Поле повинно бути масивом.",
  before: "Поле повинно бути до {0}.",
  before_or_equal: "Поле повинно бути рівне або до {0}.",
  between: "Поле повинно бути від {0} до {1}.",
  boolean: "Поле повинно бути логічним значенням.",
  confirmed: "Поле підтвердження не відповідає.",
  email: "Поле повинно бути електронною поштою.",
  date: "Поле має невірний формат дати.",
  digits: "Поле повинно бути {0} цифр.",
  digits_between: "Поле повинно бути від {0} до {1} цифр.",
  in: "Вибране поле недійсне.",
  integer: "Поле повинно бути цілим числом.",
  hex: "Поле повинно мати шістнадцятковий формат.",
  min: "Поле повинно бути не менше {0}.",
  max: "Поле не може бути більше {0}.",
  not_in: "Вибране поле недійсне.",
  numeric: "Поле повинно бути числом.",
  required: "Поле обов'язкове.",
  size: "Розмір поля повинен бути {0}.",
  string: "Поле повинно бути рядком.",
  url: "Поле повинно бути URL-адресою.",
};

export default translations;
